agenticaiuw/hivemind/firmware/nrf9160/src/main.c
	/* Capture itself succeeded if we have samples (live and/or SD). */
	error = (recorded_samples > 0U) ? 0 : (error != 0 ? error : -ENODATA);

	uint32_t rms = recorded_samples == 0U
		? 0U
		: integer_square_root(square_sum / recorded_samples);
	printk("I2S mic capture totals: samples=%u mean=%u peak=%u rms=%u "
	       "min=%d max=%d zero_crossings=%u sd_flushes=%u "
	       "live_sent=%u fifo_left=%u saturated=%d "
	       "stream_failed=%d\n",
	       recorded_samples,
	       recorded_samples == 0U
		       ? 0U
		       : (uint32_t)(recording_absolute_sum /
				    recorded_samples),
	       recorded_peak, rms, minimum_sample, maximum_sample,
	       zero_crossings, stage_flush_count,
	       pendant_cloud_stream_bytes_sent(),
	       (uint32_t)live_fifo_fill(), live_tx_saturated ? 1 : 0,
	       live_stream_failed ? 1 : 0);
	return error;
}

static int queue_i2s_stream_preamble(const struct device *i2s)
{
	for (uint32_t block_index = 0U;
	     block_index < I2S_SYNC_PATTERN_BLOCKS + 1U; ++block_index) {
		void *block;
		int16_t *output;
		int error = k_mem_slab_alloc(&i2s_slab, &block, K_FOREVER);

		if (error != 0) {
			return error;
		}
		output = block;

		for (uint32_t frame = 0U; frame < I2S_BLOCK_FRAMES; ++frame) {
			int16_t sample = 0;

			if (block_index < I2S_SYNC_PATTERN_BLOCKS) {
				uint32_t absolute_frame =
					block_index * I2S_BLOCK_FRAMES + frame;

				sample = (absolute_frame & 1U) != 0U
					 ? I2S_STREAM_SYNC_B
					 : I2S_STREAM_SYNC_A;
			} else if (frame < I2S_SYNC_END_FRAMES) {
				sample = I2S_STREAM_SYNC_END;
			}

			output[2U * frame] = sample;
			output[2U * frame + 1U] = sample;
		}

		error = i2s_write(i2s, block, I2S_BLOCK_SIZE);
		if (error != 0) {
			k_mem_slab_free(&i2s_slab, block);
			return error;
		}
	}

	return 0;
}

static int play_agent_reply(const struct device *i2s,
			    const char *pcm_path)
{
	struct i2s_config config = {
		.word_size = 16U,
		.channels = I2S_CHANNEL_COUNT,
		.format = I2S_FMT_DATA_FORMAT_I2S,
		.options = I2S_OPT_FRAME_CLK_CONTROLLER |
			   I2S_OPT_BIT_CLK_CONTROLLER,
		.frame_clk_freq = PENDANT_CLOUD_REPLY_SAMPLE_RATE,
		.mem_slab = &i2s_slab,
		.block_size = I2S_BLOCK_SIZE,
		.timeout = 3000,
	};
	struct fs_file_t file;
	struct fs_dirent entry;
	int16_t mono[I2S_BLOCK_FRAMES];
	uint32_t queued_blocks = I2S_SYNC_PATTERN_BLOCKS + 1U;
	uint32_t played_samples = 0U;
	bool started = false;
	bool file_open = false;
	int error;

	error = fs_stat(pcm_path, &entry);
	if (error != 0 || entry.type != FS_DIR_ENTRY_FILE ||
	    entry.size == 0U || (entry.size & 1U) != 0U) {
		return error != 0 ? error : -EBADMSG;
	}

	fs_file_t_init(&file);
	error = fs_open(&file, pcm_path, FS_O_READ);
	if (error != 0) {
		return error;
	}
	file_open = true;

	error = i2s_configure(i2s, I2S_DIR_TX, &config);
	if (error != 0) {
		goto out;
	}
	error = queue_i2s_stream_preamble(i2s);
	if (error != 0) {
		goto out;
	}

	while (true) {
		ssize_t bytes_read = fs_read(&file, mono, sizeof(mono));
		void *block;
		int16_t *output;

		if (bytes_read < 0) {
			error = (int)bytes_read;
			goto out;
		}
		if (bytes_read == 0) {
			break;
		}
		if ((bytes_read & 1) != 0) {
			error = -EBADMSG;
			goto out;
		}

		size_t frames = (size_t)bytes_read / sizeof(int16_t);

		error = k_mem_slab_alloc(&i2s_slab, &block, K_FOREVER);
		if (error != 0) {
			goto out;
		}
		output = block;
		for (size_t frame = 0U; frame < frames; ++frame) {
			output[2U * frame] = mono[frame];
			output[2U * frame + 1U] = mono[frame];
		}
		for (size_t frame = frames;
		     frame < I2S_BLOCK_FRAMES; ++frame) {
			output[2U * frame] = 0;
			output[2U * frame + 1U] = 0;
		}

		error = i2s_write(i2s, block, I2S_BLOCK_SIZE);
		if (error != 0) {
			k_mem_slab_free(&i2s_slab, block);
			goto out;
		}
		played_samples += (uint32_t)frames;
		++queued_blocks;

		if (!started && queued_blocks >= I2S_PREFILL_BLOCKS) {
			error = i2s_trigger(i2s, I2S_DIR_TX,
					    I2S_TRIGGER_START);
			if (error != 0) {
				goto out;
			}
			started = true;
		}
	}

	if (!started) {
		error = i2s_trigger(i2s, I2S_DIR_TX, I2S_TRIGGER_START);
		if (error != 0) {
			goto out;
		}
		started = true;
	}

	error = i2s_trigger(i2s, I2S_DIR_TX, I2S_TRIGGER_DRAIN);
	if (error == 0) {
		printk("Played %u samples of agent speech at %u Hz\n",
		       played_samples, PENDANT_CLOUD_REPLY_SAMPLE_RATE);
	}

out:
	if (file_open) {
		int close_error = fs_close(&file);

		if (error == 0) {
			error = close_error;
		}
	}
	if (error != 0 && started) {
		(void)i2s_trigger(i2s, I2S_DIR_TX, I2S_TRIGGER_DROP);
	}
	return error;
}

/*
 * Conversational autoplay: pull the model's spoken PCM off the upload socket
 * (pendant_cloud_reply_read) and drive I2S as it arrives. An I2S underrun
 * during an LTE stall is recovered by a full reconfigure + preamble — the
 * ESP32 resyncs on the preamble pattern, so a stall is a glitch, not a brick.
 */
/* Pauses are clean rebuffers now (silence, not noise) — allow more. */
#define INLINE_REPLY_MAX_RECOVERIES 12U

/* ~500 ms of 8 kHz u-law buffered before the speaker starts. When the
 * downlink proves slower than the stream rate, each starvation raises the
 * refill bar so the reply degrades into ONE longer pause, not stutter. */
#define INLINE_PREBUFFER_BYTES 4000U
#define INLINE_REBUFFER_STEP_BYTES 8000U
/* Opus wire is ~2 KB/s: ~5 packets ≈ 300 ms to start, +~600 ms per pause. */
#define INLINE_OPUS_PREBUFFER_BYTES 512U
#define INLINE_OPUS_REBUFFER_STEP 1024U
#define INLINE_OPUS_MAX_PACKET_BYTES 1275U

/*
 * Pop one complete [u16 BE length][packet] from the wire ring and decode to
 * 24 kHz mono PCM. Returns samples produced, 0 when the ring lacks a full
 * packet, <0 on protocol or decoder error.
 */
static int inline_opus_next_packet(uint8_t *ring, size_t capacity,
				   size_t *tail, size_t *count,
				   int16_t *pcm_out)
{
	static uint8_t packet[INLINE_OPUS_MAX_PACKET_BYTES];
	size_t length;

	if (*count < 2U) {
		return 0;
	}
	length = ((size_t)ring[*tail] << 8) |
		 ring[(*tail + 1U) % capacity];
	if (length == 0U || length > sizeof(packet)) {
		return -EBADMSG;
	}
	if (*count < 2U + length) {
		return 0;
	}
	*tail = (*tail + 2U) % capacity;
	for (size_t i = 0U; i < length; ++i) {
		packet[i] = ring[(*tail + i) % capacity];
	}
	*tail = (*tail + length) % capacity;
	*count -= 2U + length;
	return pendant_opus_reply_decode_packet(
		packet, length, pcm_out, PENDANT_OPUS_REPLY_FRAME_SAMPLES);
}

static int play_inline_reply(const struct device *i2s)
{
	const bool ulaw_reply =
		pendant_cloud_reply_format == PENDANT_CLOUD_AUDIO_G711_ULAW;
	const bool opus_reply =
		pendant_cloud_reply_format == PENDANT_CLOUD_AUDIO_OPUS_FRAMES;
	const uint32_t reply_rate = pendant_cloud_reply_sample_rate != 0U
					    ? pendant_cloud_reply_sample_rate
					    : PENDANT_CLOUD_REPLY_SAMPLE_RATE;
	struct i2s_config config = {
		.word_size = 16U,
		.channels = I2S_CHANNEL_COUNT,
		.format = I2S_FMT_DATA_FORMAT_I2S,
		.options = I2S_OPT_FRAME_CLK_CONTROLLER |
			   I2S_OPT_BIT_CLK_CONTROLLER,
		/* Opus decodes straight to 24 kHz; u-law is upsampled 3x on
		 * decode (8 -> 24 kHz). Either way the ESP32 bridge sees the
		 * 24000 Hz its resampler is hardcoded for. */
		.frame_clk_freq = ulaw_reply ? reply_rate * 3U : reply_rate,
		.mem_slab = &i2s_slab,
		.block_size = I2S_BLOCK_SIZE,
		.timeout = 3000,
	};
	uint32_t recoveries = 0U;
	uint32_t played_samples = 0U;
	uint32_t queued_blocks = 0U;
	uint32_t rebuffer_waits = 0U;
	bool started = false;
	bool configured = false;
	int read_result = 0;
	int error = 0;

	if (!ulaw_reply && !opus_reply) {
		/* Legacy 24 kHz PCM path (kept for relay fallback). */
		int16_t mono[I2S_BLOCK_FRAMES];

