agenticaiuw/hivemind/firmware/nrf9160/src/main.c
	k_msleep(MIC_POWERUP_BUDGET_MS);
	printk("Conversation: duplex I2S bclk_hz=%u lrclk_hz=%u "
	       "(mic %u Hz up, agent 24 kHz down)\n",
	       16000000U / MIC_BCLK_TOP, 16000000U / MIC_LRCLK_TOP,
	       SAMPLE_RATE);
	error = i2s_trigger(i2s, I2S_DIR_BOTH, I2S_TRIGGER_START);
	if (error != 0) {
		goto teardown_clocks;
	}
	i2s_running = true;
	started_at = k_uptime_get();
	clear_button_events();
	k_msgq_purge(&mic_raw_q);
	atomic_set(&audio_thread_error, 0);
	/* Hand the I2S deadlines to the audio thread from here on. */
	audio_i2s_dev = i2s;
	atomic_set(&convo_active, 1);

	while (true) {
		void *block;
		int64_t loop_started;

		/*
		 * Codec-side loop. The audio thread owns every I2S deadline;
		 * this one may take as long as an Opus frame needs without
		 * endangering the transfer. A missed block here costs mic
		 * audio (counted as mic_drops), never the conversation.
		 */
		if (k_msgq_get(&mic_raw_q, &block, K_MSEC(200)) != 0) {
			if (atomic_get(&convo_end_req) ||
			    !atomic_get(&convo_active)) {
				break;
			}
			continue;
		}
		loop_started = k_uptime_get();
		memcpy(raw_processing, block, MIC_RX_BLOCK_SIZE);
		k_mem_slab_free(&mic_rx_slab, block);

		size_t size = MIC_RX_BLOCK_SIZE;

		if (block_index < MIC_STARTUP_SKIP_BLOCKS) {
			++block_index;
			clear_button_events();
			continue;
		}
		++block_index;

		/* Decide duck/hold for THIS block before any of it is encoded. */
		convo_update_uplink_adapt();

		/* Mic DSP — the twin of record_microphone's inner loop
		 * (slew limit → decimate-average → DC blocker → gain). */
		int32_t *raw = raw_processing;
		size_t out_frames = (size / sizeof(int32_t)) / MIC_DECIMATION;

		for (size_t frame = 0U; frame < out_frames; ++frame) {
			int32_t first = raw[frame * MIC_DECIMATION] >>
					MIC_SAMPLE_SHIFT;
			int32_t second = raw[frame * MIC_DECIMATION + 1U] >>
					 MIC_SAMPLE_SHIFT;

			if (!slew_primed) {
				slew_prev = first;
				slew_primed = true;
			}
			int32_t delta = first - slew_prev;

			delta = CLAMP(delta, -MIC_SLEW_LIMIT, MIC_SLEW_LIMIT);
			slew_prev += delta;
			first = slew_prev;
			delta = second - slew_prev;
			delta = CLAMP(delta, -MIC_SLEW_LIMIT, MIC_SLEW_LIMIT);
			slew_prev += delta;
			second = slew_prev;

			int32_t sample = ((first + second) / 2) >> 8;

			if (!hpf_primed) {
				hpf_prev_in = sample;
				hpf_primed = true;
			}
			int32_t filtered =
				sample - hpf_prev_in +
				(int32_t)(((int64_t)MIC_HPF_COEFF_Q15 *
					   hpf_prev_out) >>
					  15);
			hpf_prev_in = sample;
			hpf_prev_out = filtered;

			int32_t amplified = filtered * MIC_GAIN;

			amplified = CLAMP(amplified, INT16_MIN, INT16_MAX);
			mic_stage_samples[stage_frames] = (int16_t)amplified;
			if (++stage_frames == MIC_STAGE_FRAMES) {
				live_tx_offer_stage(mic_stage_samples,
						    MIC_STAGE_FRAMES);
				stage_frames = 0U;
			}
		}
		if (live_stream_failed) {
			result = -EIO;
			break;
		}

		/* The WS thread moves bytes; this loop only decodes. The
		 * audio thread owns playback state and barge-in flushes. */
		convo_decode_downlink();

		if (atomic_get(&convo_end_req)) {
			/* Relay 'end' (mutual silence) or transport close —
			 * a normal conversation ending, not a failure. */
			printk("Conversation ended by relay/transport\n");
			error = 0;
			break;
		}

		/* Solid LED while agent audio is buffered, blink otherwise. */
		if (dl_jitter_fill() > 0U) {
			gpio_pin_set_dt(&led, 1);
			next_led_toggle = k_uptime_get() + 250;
		} else if (k_uptime_get() >= next_led_toggle) {
			gpio_pin_toggle_dt(&led);
			next_led_toggle = k_uptime_get() + 250;
		}

		if (k_uptime_get() - started_at >
		    (int64_t)CONVO_MAX_SECONDS * 1000) {
			printk("Conversation hit the %u s cap\n",
			       CONVO_MAX_SECONDS);
			break;
		}
#if PENDANT_BOOT_CONVERSATION_TEST
		if (k_uptime_get() - started_at >
		    (int64_t)PENDANT_BOOT_CONVERSATION_SECONDS * 1000) {
			printk("Self-test conversation window elapsed\n");
			break;
		}
#endif
		/* Bounce/release edges from the starting press for the first
		 * second; after that a press ends the conversation. */
		if (k_uptime_get() - started_at < 1000) {
			clear_button_events();
		} else if (k_sem_take(&button_press_sem, K_NO_WAIT) == 0 ||
			   take_remote_press()) {
			printk("Conversation ended by button\n");
			break;
		}

		/* Loop time is the whole ballgame: exceed the TX runway and
		 * the driver kills the duplex transfer. Track the worst. */
		uint32_t loop_ms = (uint32_t)(k_uptime_get() - loop_started);

		if (loop_ms > convo_max_loop_ms) {
			convo_max_loop_ms = loop_ms;
		}
	}

	/* Stop the audio thread before touching I2S or the slabs. */
	atomic_set(&convo_active, 0);
	/* Never leave the legacy record path gated by a conversation's hold. */
	convo_uplink_holding = false;
	k_msleep(30);
	if (result == 0 && atomic_get(&audio_thread_error) != 0) {
		result = (int)atomic_get(&audio_thread_error);
	}
	{
		void *stale;

		while (k_msgq_get(&mic_raw_q, &stale, K_NO_WAIT) == 0) {
			k_mem_slab_free(&mic_rx_slab, stale);
		}
	}

	printk("Conversation stats: rx_blocks=%u tx_blocks=%u tx_starved=%u "
	       "decoded_packets=%u max_loop_ms=%u fifo_left=%u "
	       "uplink_drops=%u mic_drops=%u tx_peak=%u "
	       "duck_ms=%u uplink_held=%u\n",
	       convo_rx_blocks, convo_tx_blocks, convo_tx_starved,
	       convo_decoded_packets, convo_max_loop_ms,
	       (uint32_t)live_fifo_fill(), convo_uplink_drops,
	       convo_mic_drops, convo_tx_peak, convo_uplink_duck_ms,
	       convo_uplink_held);
	printk("Codec cost: decode avg=%u us max=%u us n=%u | "
	       "encode avg=%u us max=%u us n=%u\n",
	       convo_decode_calls
		       ? cycles_to_us(convo_decode_cycles / convo_decode_calls)
		       : 0U,
	       cycles_to_us(convo_decode_max_cycles), convo_decode_calls,
	       convo_encode_calls
		       ? cycles_to_us(convo_encode_cycles / convo_encode_calls)
		       : 0U,
	       cycles_to_us(convo_encode_max_cycles), convo_encode_calls);

teardown_clocks:
	if (i2s_running) {
		/*
		 * DROP, never DRAIN: as a clock-slave, draining needs the PWM
		 * clocks to keep running until every queued TX block plays
		 * out — a 12 ms settle is not enough, and killing the clocks
		 * mid-STOPPING wedges i2s_nrfx (configure then fails -EINVAL
		 * until reboot; review finding). DROP forces READY
		 * synchronously and frees the queued blocks; the ≤41 ms of
		 * tail audio it discards is silence or flushed speech.
		 */
		(void)i2s_trigger(i2s, I2S_DIR_BOTH, I2S_TRIGGER_DROP);
		k_msleep(MIC_STOP_SETTLE_MS);
	}
	mic_clocks_stop();
	gpio_pin_set_dt(&led, 0);
teardown:
	atomic_set(&convo_active, 0);
	k_mutex_lock(&ws_lock, K_FOREVER);
	if (pendant_ws_connected() && !stop_sent) {
		(void)pendant_ws_send_text("{\"type\":\"stop\"}");
		stop_sent = true;
	}
	k_mutex_unlock(&ws_lock);
	pendant_opus_stream_abort();
	pendant_opus_reply_decoder_end();
	clear_button_events();
	if (result == 0 && error != 0) {
		result = error;
	}
	return result;
}

int main(void)
{
	const struct device *const i2s = DEVICE_DT_GET(I2S_NODE);
	int error;

	if (!gpio_is_ready_dt(&led)) {
		audio_cycle_result = -ENODEV;
		return 0;
	}
	error = gpio_pin_configure_dt(&led, GPIO_OUTPUT_INACTIVE);
	if (error != 0) {
		audio_cycle_result = error;
		return 0;
	}
	if (!gpio_is_ready_dt(&button)) {
		audio_cycle_result = -ENODEV;
		show_error();
	}
	error = gpio_pin_configure_dt(&button, GPIO_INPUT);
	if (error != 0) {
		audio_cycle_result = error;
		show_error();
	}
	gpio_init_callback(&button_callback, button_pressed, BIT(button.pin));
	error = gpio_add_callback(button.port, &button_callback);
	if (error != 0) {
		audio_cycle_result = error;
		show_error();
	}
	error = gpio_pin_interrupt_configure_dt(&button, GPIO_INT_EDGE_TO_ACTIVE);
	if (error != 0) {
		audio_cycle_result = error;
		show_error();
	}
	if (!device_is_ready(i2s)) {
		audio_cycle_result = -ENODEV;
		show_error();
	}

	if (mount_sd_card() == 0 && test_sd_persistence() != 0) {
		sd_ready = false;
	}
	if (!sd_ready) {
		printk("microSD is required for Internet voice upload\n");
		audio_cycle_result = sd_mount_result;
		show_error();
	}

#if PENDANT_BOOT_DUMP_PCM_HEX
	if (sd_ready) {
		(void)dump_sd_recording_hex();
	}
#endif

	/* Boot card check: two slow flashes means the required SD card mounted. */
	for (unsigned int flash = 0U; flash < 2U; ++flash) {
		gpio_pin_set_dt(&led, 1);
		k_msleep(160);
		gpio_pin_set_dt(&led, 0);
		k_msleep(160);
	}

#if PENDANT_BOOT_AUTORECORD_TEST
	clear_button_events();
	printk("BOOT_MIC_AUTOTEST_BEGIN\n");
	error = record_microphone(i2s, AUTORECORD_TEST_SAMPLE_COUNT);
	gpio_pin_set_dt(&led, 0);
	printk("BOOT_MIC_AUTOTEST_END result=%d samples=%u\n",
	       error, recorded_samples);
	report_main_stack_headroom("capture");
	if (error != 0) {
		audio_cycle_result = error;
		show_error();
	}
#endif

#if PENDANT_BOOT_ENCODE_SELFTEST
	/* Runs before LTE so a network problem cannot mask a codec fault. */
	if (encode_stack_selftest() != 0) {
		printk("Encode stack selftest failed\n");
	}
#endif

